keypoint_labels = [
    "顔",
    "左目(内側)",
    "左目",
    "左目(外側)",
    "右目(内側)",
    "右目",
    "右目(外側)",
    "左耳",
    "右耳",
    "口(左側)",
    "口(右側)",
    "左肩",
    "右肩",
    "左肘",
    "右肘",
    "左手",
    "右手",
    "左小指",
    "右小指",
    "左人差し指",
    "右人差し指",
    "左親指",
    "右親指",
    "左腰",
    "右腰",
    "左膝",
    "右膝",
    "左足首",
    "右足首",
    "左かかと",
    "右かかと",
    "左つま先",
    "右つま先",
]

num_of_keypoints = len(keypoint_labels)

no_checkbox_labels = [
    "鼻",
    "左耳",
    "右耳",
    "左目",
    "右目",
    "左目(内側)",
    "右目(内側)",
    "左目(外側)",
    "右目(外側)",
    "口(左側)",
    "口(右側)",
    "左小指",
    "右小指",
    "左人差し指",
    "右人差し指",
    "左親指",
    "右親指",
    "左かかと",
    "右かかと",
    "左つま先",
    "右つま先",
]

LEFT = "左"
RIGHT = "右"
FACE = "顔"

HIDE_FRAME = "カメラ画像を隠す"
SHOW_FRAME = "カメラ画像を表示する"

HIDE_BONE = "ボーンを隠す"
SHOW_BONE = "ボーンを表示する"